mobile_music_party/app/controllers/mobile_controller.rb

INSERT INTO "requests" ("created_at", "artist", "updated_at", "user_id", "song") VALUES ('2011-07-27 23:55:12.422599', 'Incubus', '2011-07-27 23:55:12.422599', NULL, 'Pardon Me')
---
  def create
      new_song = Request.new(params[:request])
      new_song.save