mobile_music_party/app/controllers/party_controller.rb

  def new
    num_songs = params[:num_songs].to_i
    current_songs = Request.count.to_i
---
SELECT "requests".* FROM "requests"
SELECT COUNT(*) FROM "requests"